<abi-corpus path='libuutil.so' architecture='elf-amd-x86_64' soname='libuutil.so.3'>
  <elf-needed>
    <dependency name='libatomic.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_sol_getmntent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_8_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='uu_msprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_open_tmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_panic' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_set_error' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_setpname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strbw' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strcaseeq' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_streq' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strndup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_vdie' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_vwarn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_vxdie' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_warn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_xdie' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_zalloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='aok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='buf' size='4110' type='tls-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='pagesize' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_exit_fatal_value' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_exit_ok_value' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_exit_usage_value' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='../../module/avl/avl.c' comp-dir-path='/home/scythe/mine.zfs/lib/libavl' language='LANG_C99'>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' filepath='../../lib/libspl/include/assert.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_assertf'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='avl_is_empty' mangled-name='avl_is_empty' filepath='../../module/avl/avl.c' line='934' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_is_empty'>
      <parameter type-id='type-id-4' name='tree' filepath='../../module/avl/avl.c' line='934' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_swap' mangled-name='avl_swap' filepath='../../module/avl/avl.c' line='871' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_swap'>
      <parameter type-id='type-id-4' name='tree1' filepath='../../module/avl/avl.c' line='871' column='1'/>
      <parameter type-id='type-id-4' name='tree2' filepath='../../module/avl/avl.c' line='871' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='avl_update' mangled-name='avl_update' filepath='../../module/avl/avl.c' line='851' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update'>
      <parameter type-id='type-id-4' name='t' filepath='../../module/avl/avl.c' line='851' column='1'/>
      <parameter type-id='type-id-6' name='obj' filepath='../../module/avl/avl.c' line='851' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_update_gt' mangled-name='avl_update_gt' filepath='../../module/avl/avl.c' line='834' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_gt'>
      <parameter type-id='type-id-4' name='t' filepath='../../module/avl/avl.c' line='834' column='1'/>
      <parameter type-id='type-id-6' name='obj' filepath='../../module/avl/avl.c' line='834' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_update_lt' mangled-name='avl_update_lt' filepath='../../module/avl/avl.c' line='817' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_lt'>
      <parameter type-id='type-id-4' name='t' filepath='../../module/avl/avl.c' line='817' column='1'/>
      <parameter type-id='type-id-6' name='obj' filepath='../../module/avl/avl.c' line='817' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='avl_add' mangled-name='avl_add' filepath='../../module/avl/avl.c' line='636' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_add'>
      <parameter type-id='type-id-4' name='tree' filepath='../../module/avl/avl.c' line='636' column='1'/>
      <parameter type-id='type-id-6' name='new_node' filepath='../../module/avl/avl.c' line='636' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='avl_insert_here' mangled-name='avl_insert_here' filepath='../../module/avl/avl.c' line='575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert_here'>
      <parameter type-id='type-id-4' name='tree' filepath='../../module/avl/avl.c' line='576' column='1'/>
      <parameter type-id='type-id-6' name='new_data' filepath='../../module/avl/avl.c' line='577' column='1'/>
      <parameter type-id='type-id-6' name='here' filepath='../../module/avl/avl.c' line='578' column='1'/>
      <parameter type-id='type-id-2' name='direction' filepath='../../module/avl/avl.c' line='579' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-4'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-1'/>
    <type-decl name='int' size-in-bits='32' id='type-id-2'/>
    <typedef-decl name='boolean_t' type-id='type-id-9' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-5'/>
    <type-decl name='void' id='type-id-3'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-6'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-8'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-9'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='avl_tree_t' type-id='type-id-12' filepath='../../include/sys/avl.h' line='119' column='1' id='type-id-7'/>
    <type-decl name='char' size-in-bits='8' id='type-id-10'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='146' column='1' id='type-id-12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-13' visibility='default' filepath='../../include/sys/avl_impl.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-14' visibility='default' filepath='../../include/sys/avl_impl.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-15' visibility='default' filepath='../../include/sys/avl_impl.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-16' visibility='default' filepath='../../include/sys/avl_impl.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='type-id-15' visibility='default' filepath='../../include/sys/avl_impl.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-13'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-14'/>
    <typedef-decl name='size_t' type-id='type-id-19' filepath='/usr/lib/gcc/x86_64-pc-linux-gnu/11.1.0/include/stddef.h' line='209' column='1' id='type-id-15'/>
    <typedef-decl name='ulong_t' type-id='type-id-19' filepath='../../lib/libspl/include/sys/stdtypes.h' line='34' column='1' id='type-id-16'/>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='90' column='1' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-20' visibility='default' filepath='../../include/sys/avl_impl.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-21' visibility='default' filepath='../../include/sys/avl_impl.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-19'/>
    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='128' id='type-id-20'>
      <subrange length='2' type-id='type-id-19' id='type-id-22'/>
    </array-type-def>
    <typedef-decl name='uintptr_t' type-id='type-id-19' filepath='/usr/include/stdint.h' line='90' column='1' id='type-id-21'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='assert.c' comp-dir-path='/home/scythe/mine.zfs/lib/libspl' language='LANG_C99'>
    <var-decl name='aok' type-id='type-id-2' mangled-name='aok' visibility='default' filepath='../../lib/libspl/include/assert.h' line='37' column='1' elf-symbol-id='aok'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='atomic.c' comp-dir-path='/home/scythe/mine.zfs/lib/libspl' language='LANG_C99'>
    <typedef-decl name='ssize_t' type-id='type-id-23' filepath='/usr/include/sys/types.h' line='108' column='1' id='type-id-24'/>
    <typedef-decl name='__ssize_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='194' column='1' id='type-id-23'/>
    <typedef-decl name='uint16_t' type-id='type-id-26' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-27'/>
    <typedef-decl name='__uint16_t' type-id='type-id-28' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-26'/>
    <typedef-decl name='int16_t' type-id='type-id-29' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-30'/>
    <typedef-decl name='__int16_t' type-id='type-id-31' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-29'/>
    <typedef-decl name='int32_t' type-id='type-id-32' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-33'/>
    <typedef-decl name='__int32_t' type-id='type-id-2' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-32'/>
    <qualified-type-def type-id='type-id-27' volatile='yes' id='type-id-34'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-35'/>
    <qualified-type-def type-id='type-id-36' volatile='yes' id='type-id-37'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-38'/>
    <qualified-type-def type-id='type-id-39' volatile='yes' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-41'/>
    <qualified-type-def type-id='type-id-16' volatile='yes' id='type-id-42'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-43'/>
    <qualified-type-def type-id='type-id-3' volatile='yes' id='type-id-44'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-45'/>
    <function-decl name='membar_consumer' mangled-name='membar_consumer' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='365' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_consumer'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='membar_producer' mangled-name='membar_producer' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_producer'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_clear_long_excl' mangled-name='atomic_clear_long_excl' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='339' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_clear_long_excl'>
      <parameter type-id='type-id-43' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='339' column='1'/>
      <parameter type-id='type-id-46' name='value' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='339' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='atomic_set_long_excl' mangled-name='atomic_set_long_excl' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='331' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_set_long_excl'>
      <parameter type-id='type-id-43' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='331' column='1'/>
      <parameter type-id='type-id-46' name='value' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='331' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='atomic_swap_ptr' mangled-name='atomic_swap_ptr' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ptr'>
      <parameter type-id='type-id-45' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='311' column='1'/>
      <parameter type-id='type-id-6' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='311' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_cas_ptr' mangled-name='atomic_cas_ptr' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='281' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ptr'>
      <parameter type-id='type-id-45' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='281' column='1'/>
      <parameter type-id='type-id-6' name='exp' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='281' column='1'/>
      <parameter type-id='type-id-6' name='des' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='281' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr_nv' mangled-name='atomic_sub_ptr_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr_nv'>
      <parameter type-id='type-id-45' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='215' column='1'/>
      <parameter type-id='type-id-24' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='215' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_add_ptr_nv' mangled-name='atomic_add_ptr_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr_nv'>
      <parameter type-id='type-id-45' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='193' column='1'/>
      <parameter type-id='type-id-24' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='193' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr' mangled-name='atomic_sub_ptr' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr'>
      <parameter type-id='type-id-45' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='103' column='1'/>
      <parameter type-id='type-id-24' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='103' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_add_ptr' mangled-name='atomic_add_ptr' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr'>
      <parameter type-id='type-id-45' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='81' column='1'/>
      <parameter type-id='type-id-24' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='81' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_inc_8' mangled-name='atomic_inc_8' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8'>
      <parameter type-id='type-id-41' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='39' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_inc_16' mangled-name='atomic_inc_16' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16'>
      <parameter type-id='type-id-35' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='41' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_inc_32' mangled-name='atomic_inc_32' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32'>
      <parameter type-id='type-id-38' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='43' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong' mangled-name='atomic_inc_ulong' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong'>
      <parameter type-id='type-id-43' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='45' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_dec_8' mangled-name='atomic_dec_8' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8'>
      <parameter type-id='type-id-41' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='55' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_dec_16' mangled-name='atomic_dec_16' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16'>
      <parameter type-id='type-id-35' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='57' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_dec_32' mangled-name='atomic_dec_32' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32'>
      <parameter type-id='type-id-38' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='59' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong' mangled-name='atomic_dec_ulong' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong'>
      <parameter type-id='type-id-43' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='61' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_add_8' mangled-name='atomic_add_8' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8'>
      <parameter type-id='type-id-41' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='71' column='1'/>
      <parameter type-id='type-id-47' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='71' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_add_16' mangled-name='atomic_add_16' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16'>
      <parameter type-id='type-id-35' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='73' column='1'/>
      <parameter type-id='type-id-30' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='73' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_add_32' mangled-name='atomic_add_32' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32'>
      <parameter type-id='type-id-38' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='75' column='1'/>
      <parameter type-id='type-id-33' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='75' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_sub_8' mangled-name='atomic_sub_8' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8'>
      <parameter type-id='type-id-41' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='93' column='1'/>
      <parameter type-id='type-id-47' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='93' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_sub_16' mangled-name='atomic_sub_16' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16'>
      <parameter type-id='type-id-35' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='95' column='1'/>
      <parameter type-id='type-id-30' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='95' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_sub_32' mangled-name='atomic_sub_32' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32'>
      <parameter type-id='type-id-38' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='97' column='1'/>
      <parameter type-id='type-id-33' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='97' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_or_8' mangled-name='atomic_or_8' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8'>
      <parameter type-id='type-id-41' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='115' column='1'/>
      <parameter type-id='type-id-39' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='115' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_or_16' mangled-name='atomic_or_16' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16'>
      <parameter type-id='type-id-35' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='117' column='1'/>
      <parameter type-id='type-id-27' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='117' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_or_32' mangled-name='atomic_or_32' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32'>
      <parameter type-id='type-id-38' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='119' column='1'/>
      <parameter type-id='type-id-36' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='119' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_or_ulong' mangled-name='atomic_or_ulong' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong'>
      <parameter type-id='type-id-43' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='121' column='1'/>
      <parameter type-id='type-id-16' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='121' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_and_8' mangled-name='atomic_and_8' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8'>
      <parameter type-id='type-id-41' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='131' column='1'/>
      <parameter type-id='type-id-39' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='131' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_and_16' mangled-name='atomic_and_16' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16'>
      <parameter type-id='type-id-35' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='133' column='1'/>
      <parameter type-id='type-id-27' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='133' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_and_32' mangled-name='atomic_and_32' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32'>
      <parameter type-id='type-id-38' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='135' column='1'/>
      <parameter type-id='type-id-36' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='135' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_and_ulong' mangled-name='atomic_and_ulong' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong'>
      <parameter type-id='type-id-43' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='137' column='1'/>
      <parameter type-id='type-id-16' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='137' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='atomic_inc_8_nv' mangled-name='atomic_inc_8_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8_nv'>
      <parameter type-id='type-id-41' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='151' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_inc_16_nv' mangled-name='atomic_inc_16_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16_nv'>
      <parameter type-id='type-id-35' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='153' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_inc_32_nv' mangled-name='atomic_inc_32_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32_nv'>
      <parameter type-id='type-id-38' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='155' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong_nv' mangled-name='atomic_inc_ulong_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong_nv'>
      <parameter type-id='type-id-43' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='157' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='atomic_dec_8_nv' mangled-name='atomic_dec_8_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8_nv'>
      <parameter type-id='type-id-41' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='167' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_dec_16_nv' mangled-name='atomic_dec_16_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16_nv'>
      <parameter type-id='type-id-35' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='169' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_dec_32_nv' mangled-name='atomic_dec_32_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='171' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32_nv'>
      <parameter type-id='type-id-38' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='171' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong_nv' mangled-name='atomic_dec_ulong_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong_nv'>
      <parameter type-id='type-id-43' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='173' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='atomic_add_8_nv' mangled-name='atomic_add_8_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8_nv'>
      <parameter type-id='type-id-41' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='183' column='1'/>
      <parameter type-id='type-id-47' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='183' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_add_16_nv' mangled-name='atomic_add_16_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16_nv'>
      <parameter type-id='type-id-35' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='185' column='1'/>
      <parameter type-id='type-id-30' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='185' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_add_32_nv' mangled-name='atomic_add_32_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32_nv'>
      <parameter type-id='type-id-38' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='187' column='1'/>
      <parameter type-id='type-id-33' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='187' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='atomic_add_long_nv' mangled-name='atomic_add_long_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long_nv'>
      <parameter type-id='type-id-43' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='189' column='1'/>
      <parameter type-id='type-id-25' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='189' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='atomic_sub_8_nv' mangled-name='atomic_sub_8_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8_nv'>
      <parameter type-id='type-id-41' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='205' column='1'/>
      <parameter type-id='type-id-47' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='205' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_sub_16_nv' mangled-name='atomic_sub_16_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16_nv'>
      <parameter type-id='type-id-35' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='207' column='1'/>
      <parameter type-id='type-id-30' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='207' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_sub_32_nv' mangled-name='atomic_sub_32_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32_nv'>
      <parameter type-id='type-id-38' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='209' column='1'/>
      <parameter type-id='type-id-33' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='209' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='atomic_sub_long_nv' mangled-name='atomic_sub_long_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_long_nv'>
      <parameter type-id='type-id-43' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='211' column='1'/>
      <parameter type-id='type-id-25' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='211' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='atomic_or_8_nv' mangled-name='atomic_or_8_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8_nv'>
      <parameter type-id='type-id-41' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='227' column='1'/>
      <parameter type-id='type-id-39' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='227' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_or_16_nv' mangled-name='atomic_or_16_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16_nv'>
      <parameter type-id='type-id-35' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='229' column='1'/>
      <parameter type-id='type-id-27' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='229' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_or_32_nv' mangled-name='atomic_or_32_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32_nv'>
      <parameter type-id='type-id-38' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='231' column='1'/>
      <parameter type-id='type-id-36' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='231' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='atomic_or_ulong_nv' mangled-name='atomic_or_ulong_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong_nv'>
      <parameter type-id='type-id-43' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='233' column='1'/>
      <parameter type-id='type-id-16' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='233' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='atomic_and_8_nv' mangled-name='atomic_and_8_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8_nv'>
      <parameter type-id='type-id-41' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='243' column='1'/>
      <parameter type-id='type-id-39' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='243' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_and_16_nv' mangled-name='atomic_and_16_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16_nv'>
      <parameter type-id='type-id-35' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='245' column='1'/>
      <parameter type-id='type-id-27' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='245' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_and_32_nv' mangled-name='atomic_and_32_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32_nv'>
      <parameter type-id='type-id-38' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='247' column='1'/>
      <parameter type-id='type-id-36' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='247' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='atomic_and_ulong_nv' mangled-name='atomic_and_ulong_nv' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong_nv'>
      <parameter type-id='type-id-43' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='249' column='1'/>
      <parameter type-id='type-id-16' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='249' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='atomic_cas_8' mangled-name='atomic_cas_8' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_8'>
      <parameter type-id='type-id-41' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='271' column='1'/>
      <parameter type-id='type-id-39' name='exp' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='271' column='1'/>
      <parameter type-id='type-id-39' name='des' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='271' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_cas_16' mangled-name='atomic_cas_16' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_16'>
      <parameter type-id='type-id-35' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='273' column='1'/>
      <parameter type-id='type-id-27' name='exp' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='273' column='1'/>
      <parameter type-id='type-id-27' name='des' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='273' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_cas_32' mangled-name='atomic_cas_32' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='275' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_32'>
      <parameter type-id='type-id-38' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='275' column='1'/>
      <parameter type-id='type-id-36' name='exp' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='275' column='1'/>
      <parameter type-id='type-id-36' name='des' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='275' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='atomic_cas_ulong' mangled-name='atomic_cas_ulong' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ulong'>
      <parameter type-id='type-id-43' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='277' column='1'/>
      <parameter type-id='type-id-16' name='exp' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='277' column='1'/>
      <parameter type-id='type-id-16' name='des' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='277' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='atomic_swap_8' mangled-name='atomic_swap_8' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_8'>
      <parameter type-id='type-id-41' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='300' column='1'/>
      <parameter type-id='type-id-39' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='300' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_swap_16' mangled-name='atomic_swap_16' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_16'>
      <parameter type-id='type-id-35' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='302' column='1'/>
      <parameter type-id='type-id-27' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='302' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='atomic_swap_32' mangled-name='atomic_swap_32' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='304' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_32'>
      <parameter type-id='type-id-38' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='304' column='1'/>
      <parameter type-id='type-id-36' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='304' column='1'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='atomic_swap_ulong' mangled-name='atomic_swap_ulong' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ulong'>
      <parameter type-id='type-id-43' name='target' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='306' column='1'/>
      <parameter type-id='type-id-16' name='bits' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='306' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='membar_enter' mangled-name='membar_enter' filepath='/home/scythe/mine.zfs/lib/libspl/atomic.c' line='347' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_enter'>
      <return type-id='type-id-3'/>
    </function-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-25'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-31'/>
    <typedef-decl name='int8_t' type-id='type-id-48' filepath='/usr/include/bits/stdint-intn.h' line='24' column='1' id='type-id-47'/>
    <typedef-decl name='uint32_t' type-id='type-id-49' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-36'/>
    <typedef-decl name='uint8_t' type-id='type-id-50' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-39'/>
    <typedef-decl name='uint_t' type-id='type-id-51' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-46'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-28'/>
    <typedef-decl name='__int8_t' type-id='type-id-52' filepath='/usr/include/bits/types.h' line='37' column='1' id='type-id-48'/>
    <typedef-decl name='__uint32_t' type-id='type-id-51' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-49'/>
    <typedef-decl name='__uint8_t' type-id='type-id-53' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-50'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-51'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-52'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-53'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='list.c' comp-dir-path='/home/scythe/mine.zfs/lib/libspl' language='LANG_C99'>
    <typedef-decl name='list_t' type-id='type-id-54' filepath='../../lib/libspl/include/sys/list.h' line='36' column='1' id='type-id-55'/>
    <class-decl name='list' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='41' column='1' id='type-id-54'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='list_size' type-id='type-id-15' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='list_offset' type-id='type-id-15' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='list_head' type-id='type-id-56' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='44' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='list_node' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='36' column='1' id='type-id-56'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-57' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-57' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='list_node_t' type-id='type-id-56' filepath='../../lib/libspl/include/sys/list.h' line='35' column='1' id='type-id-58'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-60'/>
    <function-decl name='list_is_empty' mangled-name='list_is_empty' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_is_empty'>
      <parameter type-id='type-id-60' name='list' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='240' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_link_active' mangled-name='list_link_active' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_active'>
      <parameter type-id='type-id-59' name='ln' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='233' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='list_link_init' mangled-name='list_link_init' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_init'>
      <parameter type-id='type-id-59' name='ln' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='226' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='list_link_replace' mangled-name='list_link_replace' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_replace'>
      <parameter type-id='type-id-59' name='lold' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='213' column='1'/>
      <parameter type-id='type-id-59' name='lnew' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='213' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='list_move_tail' mangled-name='list_move_tail' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_move_tail'>
      <parameter type-id='type-id-60' name='dst' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='192' column='1'/>
      <parameter type-id='type-id-60' name='src' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='192' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='list_prev' mangled-name='list_prev' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_prev'>
      <parameter type-id='type-id-60' name='list' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='178' column='1'/>
      <parameter type-id='type-id-6' name='object' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='178' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_next' mangled-name='list_next' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_next'>
      <parameter type-id='type-id-60' name='list' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='167' column='1'/>
      <parameter type-id='type-id-6' name='object' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='167' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_tail' mangled-name='list_tail' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_tail'>
      <parameter type-id='type-id-60' name='list' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='159' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_head' mangled-name='list_head' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_head'>
      <parameter type-id='type-id-60' name='list' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='151' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_remove_tail' mangled-name='list_remove_tail' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_tail'>
      <parameter type-id='type-id-60' name='list' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='141' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_remove_head' mangled-name='list_remove_head' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_head'>
      <parameter type-id='type-id-60' name='list' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='131' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='list_remove' mangled-name='list_remove' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove'>
      <parameter type-id='type-id-60' name='list' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='122' column='1'/>
      <parameter type-id='type-id-6' name='object' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='122' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='list_insert_tail' mangled-name='list_insert_tail' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_tail'>
      <parameter type-id='type-id-60' name='list' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='115' column='1'/>
      <parameter type-id='type-id-6' name='object' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='115' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='list_insert_head' mangled-name='list_insert_head' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_head'>
      <parameter type-id='type-id-60' name='list' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='108' column='1'/>
      <parameter type-id='type-id-6' name='object' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='108' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='list_insert_before' mangled-name='list_insert_before' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_before'>
      <parameter type-id='type-id-60' name='list' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='97' column='1'/>
      <parameter type-id='type-id-6' name='object' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='97' column='1'/>
      <parameter type-id='type-id-6' name='nobject' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='97' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='list_insert_after' mangled-name='list_insert_after' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_after'>
      <parameter type-id='type-id-60' name='list' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='86' column='1'/>
      <parameter type-id='type-id-6' name='object' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='86' column='1'/>
      <parameter type-id='type-id-6' name='nobject' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='86' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='list_destroy' mangled-name='list_destroy' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_destroy'>
      <parameter type-id='type-id-60' name='list' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='74' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='list_create' mangled-name='list_create' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_create'>
      <parameter type-id='type-id-60' name='list' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='62' column='1'/>
      <parameter type-id='type-id-15' name='size' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='62' column='1'/>
      <parameter type-id='type-id-15' name='offset' filepath='/home/scythe/mine.zfs/lib/libspl/list.c' line='62' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='mkdirp.c' comp-dir-path='/home/scythe/mine.zfs/lib/libspl' language='LANG_C99'>
    <typedef-decl name='wchar_t' type-id='type-id-2' filepath='/usr/lib/gcc/x86_64-pc-linux-gnu/11.1.0/include/stddef.h' line='321' column='1' id='type-id-61'/>
    <typedef-decl name='__mode_t' type-id='type-id-51' filepath='/usr/include/bits/types.h' line='150' column='1' id='type-id-62'/>
    <typedef-decl name='mode_t' type-id='type-id-62' filepath='/usr/include/sys/types.h' line='69' column='1' id='type-id-63'/>
    <qualified-type-def type-id='type-id-64' restrict='yes' id='type-id-65'/>
    <qualified-type-def type-id='type-id-61' const='yes' id='type-id-66'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-67'/>
    <qualified-type-def type-id='type-id-67' restrict='yes' id='type-id-68'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-69'/>
    <qualified-type-def type-id='type-id-69' restrict='yes' id='type-id-70'/>
    <function-decl name='wcstombs' filepath='/usr/include/stdlib.h' line='937' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-65'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='mbstowcs' filepath='/usr/include/stdlib.h' line='933' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='access' filepath='/usr/include/unistd.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='mkdir' filepath='/usr/include/sys/stat.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='mkdirp' mangled-name='mkdirp' filepath='/home/scythe/mine.zfs/lib/libspl/mkdirp.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkdirp'>
      <parameter type-id='type-id-1' name='d' filepath='/home/scythe/mine.zfs/lib/libspl/mkdirp.c' line='50' column='1'/>
      <parameter type-id='type-id-63' name='mode' filepath='/home/scythe/mine.zfs/lib/libspl/mkdirp.c' line='50' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-64'/>
    <qualified-type-def type-id='type-id-1' restrict='yes' id='type-id-71'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/getexecname.c' comp-dir-path='/home/scythe/mine.zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='readlink' filepath='/usr/include/unistd.h' line='820' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-65'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-24'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/gethostid.c' comp-dir-path='/home/scythe/mine.zfs/lib/libspl' language='LANG_C99'>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-72'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-73'/>
    <qualified-type-def type-id='type-id-73' restrict='yes' id='type-id-74'/>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='strtoull' filepath='/usr/include/stdlib.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-72'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='634' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='read' filepath='/usr/include/unistd.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='get_system_hostid' mangled-name='get_system_hostid' filepath='os/linux/gethostid.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_system_hostid'>
      <return type-id='type-id-19'/>
    </function-decl>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-75'/>
    <typedef-decl name='FILE' type-id='type-id-77' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-76'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-78' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-79' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-80' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-28' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-52' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-81' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-82' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-83' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-84' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-85' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-79' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-86' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-85'/>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='8' id='type-id-81'>
      <subrange length='1' type-id='type-id-19' id='type-id-91'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='160' id='type-id-86'>
      <subrange length='20' type-id='type-id-19' id='type-id-92'/>
    </array-type-def>
    <typedef-decl name='__off64_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-83'/>
    <typedef-decl name='__off_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-80'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-87'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-89'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-90'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-3' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-88'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/getmntany.c' comp-dir-path='/home/scythe/mine.zfs/lib/libspl' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-93' size-in-bits='192' id='type-id-94'>
      <subrange length='3' type-id='type-id-19' id='type-id-95'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='32880' id='type-id-96'>
      <subrange length='4110' type-id='type-id-19' id='type-id-97'/>
    </array-type-def>
    <class-decl name='stat64' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='99' column='1' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-99' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-100' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-101' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-62' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-102' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-103' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-99' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-80' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-104' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-105' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-106' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-106' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-106' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-94' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='144' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='type-id-19' filepath='/usr/include/bits/types.h' line='145' column='1' id='type-id-99'/>
    <typedef-decl name='__ino64_t' type-id='type-id-19' filepath='/usr/include/bits/types.h' line='149' column='1' id='type-id-100'/>
    <typedef-decl name='__nlink_t' type-id='type-id-19' filepath='/usr/include/bits/types.h' line='151' column='1' id='type-id-101'/>
    <typedef-decl name='__uid_t' type-id='type-id-51' filepath='/usr/include/bits/types.h' line='146' column='1' id='type-id-102'/>
    <typedef-decl name='__gid_t' type-id='type-id-51' filepath='/usr/include/bits/types.h' line='147' column='1' id='type-id-103'/>
    <typedef-decl name='__blksize_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='175' column='1' id='type-id-104'/>
    <typedef-decl name='__blkcnt64_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='181' column='1' id='type-id-105'/>
    <class-decl name='mntent' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/mntent.h' line='51' column='1' id='type-id-107'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_fsname' type-id='type-id-64' visibility='default' filepath='/usr/include/mntent.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_dir' type-id='type-id-64' visibility='default' filepath='/usr/include/mntent.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_type' type-id='type-id-64' visibility='default' filepath='/usr/include/mntent.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_opts' type-id='type-id-64' visibility='default' filepath='/usr/include/mntent.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_freq' type-id='type-id-2' visibility='default' filepath='/usr/include/mntent.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_passno' type-id='type-id-2' visibility='default' filepath='/usr/include/mntent.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='extmnttab' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='62' column='1' id='type-id-108'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-64' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-64' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-64' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-64' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_major' type-id='type-id-46' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_minor' type-id='type-id-46' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='49' column='1' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-64' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-64' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-64' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-64' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-110'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-111'/>
    <qualified-type-def type-id='type-id-111' restrict='yes' id='type-id-112'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-113'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-114'/>
    <qualified-type-def type-id='type-id-114' restrict='yes' id='type-id-115'/>
    <var-decl name='buf' type-id='type-id-96' mangled-name='buf' visibility='default' filepath='os/linux/getmntany.c' line='44' column='1' elf-symbol-id='buf'/>
    <function-decl name='stat64' filepath='/usr/include/sys/stat.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='feof' filepath='/usr/include/stdio.h' line='764' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='getmntent_r' filepath='/usr/include/mntent.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-65'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-111'/>
    </function-decl>
    <function-decl name='getextmntent' mangled-name='getextmntent' filepath='os/linux/getmntany.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getextmntent'>
      <parameter type-id='type-id-1' name='path' filepath='os/linux/getmntany.c' line='106' column='1'/>
      <parameter type-id='type-id-110' name='entry' filepath='os/linux/getmntany.c' line='106' column='1'/>
      <parameter type-id='type-id-114' name='statbuf' filepath='os/linux/getmntany.c' line='106' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='getmntany' mangled-name='getmntany' filepath='os/linux/getmntany.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntany'>
      <parameter type-id='type-id-75' name='fp' filepath='os/linux/getmntany.c' line='51' column='1'/>
      <parameter type-id='type-id-113' name='mgetp' filepath='os/linux/getmntany.c' line='51' column='1'/>
      <parameter type-id='type-id-113' name='mrefp' filepath='os/linux/getmntany.c' line='51' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='_sol_getmntent' mangled-name='_sol_getmntent' filepath='os/linux/getmntany.c' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_sol_getmntent'>
      <parameter type-id='type-id-75' name='fp' filepath='os/linux/getmntany.c' line='64' column='1'/>
      <parameter type-id='type-id-113' name='mgetp' filepath='os/linux/getmntany.c' line='64' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <qualified-type-def type-id='type-id-75' restrict='yes' id='type-id-116'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='10' column='1' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-117' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-93' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='197' column='1' id='type-id-93'/>
    <typedef-decl name='__time_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-117'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/zone.c' comp-dir-path='/home/scythe/mine.zfs/lib/libspl' language='LANG_C99'>
    <typedef-decl name='zoneid_t' type-id='type-id-2' filepath='../../lib/libspl/include/sys/types.h' line='47' column='1' id='type-id-118'/>
    <function-decl name='getzoneid' mangled-name='getzoneid' filepath='os/linux/zone.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getzoneid'>
      <return type-id='type-id-118'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='page.c' comp-dir-path='/home/scythe/mine.zfs/lib/libspl' language='LANG_C99'>
    <var-decl name='pagesize' type-id='type-id-15' mangled-name='pagesize' visibility='default' filepath='/home/scythe/mine.zfs/lib/libspl/page.c' line='25' column='1' elf-symbol-id='pagesize'/>
    <function-decl name='sysconf' filepath='/usr/include/unistd.h' line='630' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='spl_pagesize' mangled-name='spl_pagesize' filepath='/home/scythe/mine.zfs/lib/libspl/page.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spl_pagesize'>
      <return type-id='type-id-15'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='strlcat.c' comp-dir-path='/home/scythe/mine.zfs/lib/libspl' language='LANG_C99'>
    <function-decl name='strlcat' mangled-name='strlcat' filepath='/home/scythe/mine.zfs/lib/libspl/strlcat.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcat'>
      <parameter type-id='type-id-64' name='dst' filepath='/home/scythe/mine.zfs/lib/libspl/strlcat.c' line='39' column='1'/>
      <parameter type-id='type-id-1' name='src' filepath='/home/scythe/mine.zfs/lib/libspl/strlcat.c' line='39' column='1'/>
      <parameter type-id='type-id-15' name='dstsize' filepath='/home/scythe/mine.zfs/lib/libspl/strlcat.c' line='39' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='timestamp.c' comp-dir-path='/home/scythe/mine.zfs/lib/libspl' language='LANG_C99'>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='7' column='1' id='type-id-119'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-25' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='time_t' type-id='type-id-117' filepath='/usr/include/bits/types/time_t.h' line='7' column='1' id='type-id-120'/>
    <typedef-decl name='nl_item' type-id='type-id-2' filepath='/usr/include/nl_types.h' line='36' column='1' id='type-id-121'/>
    <qualified-type-def type-id='type-id-120' const='yes' id='type-id-122'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-123'/>
    <qualified-type-def type-id='type-id-119' const='yes' id='type-id-124'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-125'/>
    <qualified-type-def type-id='type-id-125' restrict='yes' id='type-id-126'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-127'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-128'/>
    <function-decl name='strftime' filepath='/usr/include/time.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-65'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='localtime' filepath='/usr/include/time.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-128'/>
    </function-decl>
    <function-decl name='printf' filepath='/usr/include/stdio.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nl_langinfo' filepath='/usr/include/langinfo.h' line='661' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-121'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='time' filepath='/usr/include/time.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-127'/>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='print_timestamp' mangled-name='print_timestamp' filepath='/home/scythe/mine.zfs/lib/libspl/timestamp.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='print_timestamp'>
      <parameter type-id='type-id-46' name='timestamp_fmt' filepath='/home/scythe/mine.zfs/lib/libspl/timestamp.c' line='44' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_alloc.c' comp-dir-path='/home/scythe/mine.zfs/lib/libuutil' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-10'/>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-129'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-51' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-6' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-2'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-51'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-19'/>
    <type-decl name='variadic parameter type' id='type-id-130'/>
    <type-decl name='void' id='type-id-3'/>
    <typedef-decl name='size_t' type-id='type-id-19' filepath='/usr/lib/gcc/x86_64-pc-linux-gnu/11.1.0/include/stddef.h' line='209' column='1' id='type-id-15'/>
    <typedef-decl name='uint_t' type-id='type-id-51' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-46'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-131'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-64'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-8'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-1'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-6'/>
    <function-decl name='vsnprintf' filepath='/usr/include/stdio.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-131'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='strnlen' filepath='/usr/include/string.h' line='397' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='391' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='565' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_set_error' mangled-name='uu_set_error' filepath='../../include/libuutil_impl.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_set_error'>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_msprintf' mangled-name='uu_msprintf' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_alloc.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_msprintf'>
      <parameter type-id='type-id-1' name='format' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_alloc.c' line='108' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='uu_memdup' mangled-name='uu_memdup' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_alloc.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_memdup'>
      <parameter type-id='type-id-6' name='buf' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_alloc.c' line='96' column='1'/>
      <parameter type-id='type-id-15' name='sz' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_alloc.c' line='96' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_strndup' mangled-name='uu_strndup' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_alloc.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strndup'>
      <parameter type-id='type-id-1' name='s' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_alloc.c' line='74' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_alloc.c' line='74' column='1'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='uu_strdup' mangled-name='uu_strdup' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_alloc.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strdup'>
      <parameter type-id='type-id-1' name='str' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_alloc.c' line='54' column='1'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='uu_free' mangled-name='uu_free' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_alloc.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_free'>
      <parameter type-id='type-id-6' name='p' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_alloc.c' line='48' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_zalloc' mangled-name='uu_zalloc' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_alloc.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_zalloc'>
      <parameter type-id='type-id-15' name='n' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_alloc.c' line='33' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_avl.c' comp-dir-path='/home/scythe/mine.zfs/lib/libuutil' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-13' size-in-bits='128' id='type-id-20'>
      <subrange length='2' type-id='type-id-19' id='type-id-22'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='320' id='type-id-132'>
      <subrange length='40' type-id='type-id-19' id='type-id-133'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='32' id='type-id-134'>
      <subrange length='4' type-id='type-id-19' id='type-id-135'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='512' id='type-id-136'>
      <subrange length='64' type-id='type-id-19' id='type-id-137'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='type-id-25'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-31'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-52'/>
    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='192' id='type-id-138'>
      <subrange length='3' type-id='type-id-19' id='type-id-95'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-53'/>
    <typedef-decl name='avl_tree_t' type-id='type-id-12' filepath='../../include/sys/avl.h' line='119' column='1' id='type-id-7'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='146' column='1' id='type-id-12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-13' visibility='default' filepath='../../include/sys/avl_impl.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-14' visibility='default' filepath='../../include/sys/avl_impl.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-15' visibility='default' filepath='../../include/sys/avl_impl.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-16' visibility='default' filepath='../../include/sys/avl_impl.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='type-id-15' visibility='default' filepath='../../include/sys/avl_impl.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='90' column='1' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-20' visibility='default' filepath='../../include/sys/avl_impl.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-21' visibility='default' filepath='../../include/sys/avl_impl.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uintptr_t' type-id='type-id-19' filepath='/usr/include/stdint.h' line='90' column='1' id='type-id-21'/>
    <typedef-decl name='ulong_t' type-id='type-id-19' filepath='../../lib/libspl/include/sys/stdtypes.h' line='34' column='1' id='type-id-16'/>
    <typedef-decl name='avl_index_t' type-id='type-id-21' filepath='../../include/sys/avl.h' line='130' column='1' id='type-id-139'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-140' filepath='/usr/include/bits/pthreadtypes.h' line='72' column='1' id='type-id-141'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='67' column='1' id='type-id-140'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-142' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-132' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-25' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='22' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-31' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-31' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-143' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='type-id-144' filepath='/usr/include/bits/thread-shared-types.h' line='53' column='1' id='type-id-143'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='49' column='1' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-145' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-145' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pthread_mutexattr_t' type-id='type-id-146' filepath='/usr/include/bits/pthreadtypes.h' line='36' column='1' id='type-id-147'/>
    <union-decl name='__anonymous_union__1' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='32' column='1' id='type-id-146'>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-134' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='34' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='35' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='uu_avl' size-in-bits='960' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='137' column='1' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ua_next_enc' type-id='type-id-21' visibility='default' filepath='../../include/libuutil_impl.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ua_prev_enc' type-id='type-id-21' visibility='default' filepath='../../include/libuutil_impl.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ua_pool' type-id='type-id-149' visibility='default' filepath='../../include/libuutil_impl.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ua_parent_enc' type-id='type-id-21' visibility='default' filepath='../../include/libuutil_impl.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ua_debug' type-id='type-id-39' visibility='default' filepath='../../include/libuutil_impl.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='ua_index' type-id='type-id-39' visibility='default' filepath='../../include/libuutil_impl.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ua_tree' type-id='type-id-12' visibility='default' filepath='../../include/libuutil_impl.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ua_null_walk' type-id='type-id-150' visibility='default' filepath='../../include/libuutil_impl.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='uu_avl_pool' size-in-bits='2176' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='154' column='1' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uap_next' type-id='type-id-149' visibility='default' filepath='../../include/libuutil_impl.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uap_prev' type-id='type-id-149' visibility='default' filepath='../../include/libuutil_impl.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uap_name' type-id='type-id-136' visibility='default' filepath='../../include/libuutil_impl.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='uap_nodeoffset' type-id='type-id-15' visibility='default' filepath='../../include/libuutil_impl.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='uap_objsize' type-id='type-id-15' visibility='default' filepath='../../include/libuutil_impl.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='uap_cmp' type-id='type-id-152' visibility='default' filepath='../../include/libuutil_impl.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='uap_debug' type-id='type-id-39' visibility='default' filepath='../../include/libuutil_impl.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='840'>
        <var-decl name='uap_last_index' type-id='type-id-39' visibility='default' filepath='../../include/libuutil_impl.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='uap_lock' type-id='type-id-141' visibility='default' filepath='../../include/libuutil_impl.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='uap_null_avl' type-id='type-id-153' visibility='default' filepath='../../include/libuutil_impl.h' line='165' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_avl_pool_t' type-id='type-id-151' filepath='../../include/libuutil.h' line='287' column='1' id='type-id-154'/>
    <typedef-decl name='uu_compare_fn_t' type-id='type-id-155' filepath='../../include/libuutil.h' line='159' column='1' id='type-id-156'/>
    <typedef-decl name='uint8_t' type-id='type-id-50' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-39'/>
    <typedef-decl name='__uint8_t' type-id='type-id-53' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-50'/>
    <typedef-decl name='uu_avl_t' type-id='type-id-148' filepath='../../include/libuutil.h' line='288' column='1' id='type-id-153'/>
    <class-decl name='uu_avl_walk' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='127' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uaw_next' type-id='type-id-158' visibility='default' filepath='../../include/libuutil_impl.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uaw_prev' type-id='type-id-158' visibility='default' filepath='../../include/libuutil_impl.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uaw_avl' type-id='type-id-159' visibility='default' filepath='../../include/libuutil_impl.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='uaw_next_result' type-id='type-id-6' visibility='default' filepath='../../include/libuutil_impl.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='uaw_dir' type-id='type-id-47' visibility='default' filepath='../../include/libuutil_impl.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='uaw_robust' type-id='type-id-39' visibility='default' filepath='../../include/libuutil_impl.h' line='134' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_avl_walk_t' type-id='type-id-157' filepath='../../include/libuutil.h' line='298' column='1' id='type-id-150'/>
    <typedef-decl name='int8_t' type-id='type-id-48' filepath='/usr/include/bits/stdint-intn.h' line='24' column='1' id='type-id-47'/>
    <typedef-decl name='__int8_t' type-id='type-id-52' filepath='/usr/include/bits/types.h' line='37' column='1' id='type-id-48'/>
    <typedef-decl name='uu_avl_index_t' type-id='type-id-21' filepath='../../include/libuutil.h' line='300' column='1' id='type-id-160'/>
    <typedef-decl name='uu_walk_fn_t' type-id='type-id-18' filepath='../../include/libuutil.h' line='183' column='1' id='type-id-161'/>
    <typedef-decl name='uint32_t' type-id='type-id-49' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-36'/>
    <typedef-decl name='__uint32_t' type-id='type-id-51' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-49'/>
    <typedef-decl name='uu_avl_node_t' type-id='type-id-162' filepath='../../include/libuutil.h' line='296' column='1' id='type-id-163'/>
    <class-decl name='uu_avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/libuutil.h' line='290' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uan_opaque' type-id='type-id-138' visibility='default' filepath='../../include/libuutil.h' line='292' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-164'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-13'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-165'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-4'/>
    <qualified-type-def type-id='type-id-147' const='yes' id='type-id-166'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-169'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-170'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-149'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-159'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-158'/>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-152'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-172'/>
    <function-decl name='avl_nearest' mangled-name='avl_nearest' filepath='../../include/sys/avl.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_nearest'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-139'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_insert' mangled-name='avl_insert' filepath='../../include/sys/avl.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-139'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='avl_find' mangled-name='avl_find' filepath='../../include/sys/avl.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_find'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-164'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' mangled-name='avl_destroy_nodes' filepath='../../include/sys/avl.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy_nodes'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-172'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_remove' mangled-name='avl_remove' filepath='../../include/sys/avl.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_remove'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='avl_walk' mangled-name='avl_walk' filepath='../../include/sys/avl_impl.h' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_walk'>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_last' mangled-name='avl_last' filepath='../../include/sys/avl.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_last'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_first' mangled-name='avl_first' filepath='../../include/sys/avl.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_first'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='avl_destroy' mangled-name='avl_destroy' filepath='../../include/sys/avl.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='avl_numnodes' mangled-name='avl_numnodes' filepath='../../include/sys/avl.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_numnodes'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='avl_create' mangled-name='avl_create' filepath='../../include/sys/avl.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_create'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' filepath='/usr/include/pthread.h' line='763' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_panic' mangled-name='uu_panic' filepath='../../include/libuutil_impl.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_panic'>
      <parameter type-id='type-id-1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='789' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='771' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' filepath='/usr/include/pthread.h' line='758' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='strlcpy' mangled-name='strlcpy' filepath='../../lib/libspl/include/string.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcpy'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='uu_check_name' mangled-name='uu_check_name' filepath='../../include/libuutil.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_check_name'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_release' mangled-name='uu_avl_release' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='562' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_release'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_avl_lockup' mangled-name='uu_avl_lockup' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_lockup'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_avl_nearest_prev' mangled-name='uu_avl_nearest_prev' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='538' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_nearest_prev'>
      <parameter type-id='type-id-159' name='ap' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='538' column='1'/>
      <parameter type-id='type-id-160' name='idx' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='538' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_nearest_next' mangled-name='uu_avl_nearest_next' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='528' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_nearest_next'>
      <parameter type-id='type-id-159' name='ap' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='528' column='1'/>
      <parameter type-id='type-id-160' name='idx' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='528' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_insert' mangled-name='uu_avl_insert' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='494' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_insert'>
      <parameter type-id='type-id-159' name='ap' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='494' column='1'/>
      <parameter type-id='type-id-6' name='elem' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='494' column='1'/>
      <parameter type-id='type-id-160' name='idx' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='494' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_avl_find' mangled-name='uu_avl_find' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='473' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_find'>
      <parameter type-id='type-id-159' name='ap' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='473' column='1'/>
      <parameter type-id='type-id-6' name='elem' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='473' column='1'/>
      <parameter type-id='type-id-6' name='private' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='473' column='1'/>
      <parameter type-id='type-id-169' name='out' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='473' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_teardown' mangled-name='uu_avl_teardown' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='458' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_teardown'>
      <parameter type-id='type-id-159' name='ap' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='458' column='1'/>
      <parameter type-id='type-id-172' name='cookie' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='458' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_remove' mangled-name='uu_avl_remove' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='422' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_remove'>
      <parameter type-id='type-id-159' name='ap' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='422' column='1'/>
      <parameter type-id='type-id-6' name='elem' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='422' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_avl_walk' mangled-name='uu_avl_walk' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk'>
      <parameter type-id='type-id-159' name='ap' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='397' column='1'/>
      <parameter type-id='type-id-171' name='func' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='397' column='1'/>
      <parameter type-id='type-id-6' name='private' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='397' column='1'/>
      <parameter type-id='type-id-36' name='flags' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='397' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_avl_walk_end' mangled-name='uu_avl_walk_end' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='390' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk_end'>
      <parameter type-id='type-id-158' name='wp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='390' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_avl_walk_next' mangled-name='uu_avl_walk_next' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk_next'>
      <parameter type-id='type-id-158' name='wp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='384' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_walk_start' mangled-name='uu_avl_walk_start' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk_start'>
      <parameter type-id='type-id-159' name='ap' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='364' column='1'/>
      <parameter type-id='type-id-36' name='flags' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='364' column='1'/>
      <return type-id='type-id-158'/>
    </function-decl>
    <function-decl name='uu_avl_prev' mangled-name='uu_avl_prev' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='303' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_prev'>
      <parameter type-id='type-id-159' name='ap' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='303' column='1'/>
      <parameter type-id='type-id-6' name='node' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='303' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_next' mangled-name='uu_avl_next' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='297' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_next'>
      <parameter type-id='type-id-159' name='ap' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='297' column='1'/>
      <parameter type-id='type-id-6' name='node' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='297' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_last' mangled-name='uu_avl_last' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_last'>
      <parameter type-id='type-id-159' name='ap' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='291' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_first' mangled-name='uu_avl_first' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='285' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_first'>
      <parameter type-id='type-id-159' name='ap' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='285' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_avl_numnodes' mangled-name='uu_avl_numnodes' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_numnodes'>
      <parameter type-id='type-id-159' name='ap' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='279' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='uu_avl_destroy' mangled-name='uu_avl_destroy' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_destroy'>
      <parameter type-id='type-id-159' name='ap' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='250' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_avl_create' mangled-name='uu_avl_create' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_create'>
      <parameter type-id='type-id-149' name='pp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='211' column='1'/>
      <parameter type-id='type-id-6' name='parent' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='211' column='1'/>
      <parameter type-id='type-id-36' name='flags' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='211' column='1'/>
      <return type-id='type-id-159'/>
    </function-decl>
    <function-decl name='uu_avl_node_fini' mangled-name='uu_avl_node_fini' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_node_fini'>
      <parameter type-id='type-id-6' name='base' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='163' column='1'/>
      <parameter type-id='type-id-170' name='np' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='163' column='1'/>
      <parameter type-id='type-id-149' name='pp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='163' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_avl_node_init' mangled-name='uu_avl_node_init' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_node_init'>
      <parameter type-id='type-id-6' name='base' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='138' column='1'/>
      <parameter type-id='type-id-170' name='np' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='138' column='1'/>
      <parameter type-id='type-id-149' name='pp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='138' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_avl_pool_destroy' mangled-name='uu_avl_pool_destroy' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_pool_destroy'>
      <parameter type-id='type-id-149' name='pp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='114' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_avl_pool_create' mangled-name='uu_avl_pool_create' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_pool_create'>
      <parameter type-id='type-id-1' name='name' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='66' column='1'/>
      <parameter type-id='type-id-15' name='objsize' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='66' column='1'/>
      <parameter type-id='type-id-15' name='nodeoffset' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='66' column='1'/>
      <parameter type-id='type-id-152' name='compare_func' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='67' column='1'/>
      <parameter type-id='type-id-36' name='flags' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_avl.c' line='67' column='1'/>
      <return type-id='type-id-149'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-18'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-155'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-2'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_dprintf.c' comp-dir-path='/home/scythe/mine.zfs/lib/libuutil' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='8' id='type-id-81'>
      <subrange length='1' type-id='type-id-19' id='type-id-91'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='160' id='type-id-86'>
      <subrange length='20' type-id='type-id-19' id='type-id-92'/>
    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-87'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-89'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-90'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-11'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-28'/>
    <typedef-decl name='FILE' type-id='type-id-77' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-76'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-78' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-79' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-80' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-28' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-52' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-81' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-82' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-83' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-84' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-85' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-79' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-86' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__off_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-80'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-3' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-88'/>
    <typedef-decl name='__off64_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-83'/>
    <typedef-decl name='uu_dprintf_t' type-id='type-id-173' filepath='../../include/libuutil.h' line='104' column='1' id='type-id-174'/>
    <class-decl name='uu_dprintf' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='49' column='1' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uud_name' type-id='type-id-64' visibility='default' filepath='../../include/libuutil_impl.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uud_severity' type-id='type-id-175' visibility='default' filepath='../../include/libuutil_impl.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='uud_flags' type-id='type-id-46' visibility='default' filepath='../../include/libuutil_impl.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_dprintf_severity_t' type-id='type-id-176' filepath='../../include/libuutil.h' line='113' column='1' id='type-id-175'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/libuutil.h' line='106' column='1' id='type-id-176'>
      <underlying-type type-id='type-id-11'/>
      <enumerator name='UU_DPRINTF_SILENT' value='0'/>
      <enumerator name='UU_DPRINTF_FATAL' value='1'/>
      <enumerator name='UU_DPRINTF_WARNING' value='2'/>
      <enumerator name='UU_DPRINTF_NOTICE' value='3'/>
      <enumerator name='UU_DPRINTF_INFO' value='4'/>
      <enumerator name='UU_DPRINTF_DEBUG' value='5'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-75'/>
    <qualified-type-def type-id='type-id-75' restrict='yes' id='type-id-116'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-85'/>
    <qualified-type-def type-id='type-id-1' restrict='yes' id='type-id-71'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-177'/>
    <function-decl name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='vfprintf' filepath='/usr/include/stdio.h' line='341' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-131'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='326' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-71'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='strdup' filepath='/usr/include/string.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='uu_dprintf_getname' mangled-name='uu_dprintf_getname' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_dprintf.c' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_dprintf_getname'>
      <parameter type-id='type-id-177' name='D' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_dprintf.c' line='127' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uu_dprintf_destroy' mangled-name='uu_dprintf_destroy' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_dprintf.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_dprintf_destroy'>
      <parameter type-id='type-id-177' name='D' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_dprintf.c' line='118' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_dprintf' mangled-name='uu_dprintf' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_dprintf.c' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_dprintf'>
      <parameter type-id='type-id-177' name='D' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_dprintf.c' line='99' column='1'/>
      <parameter type-id='type-id-175' name='severity' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_dprintf.c' line='99' column='1'/>
      <parameter type-id='type-id-1' name='format' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_dprintf.c' line='100' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_dprintf_create' mangled-name='uu_dprintf_create' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_dprintf.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_dprintf_create'>
      <parameter type-id='type-id-1' name='name' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_dprintf.c' line='67' column='1'/>
      <parameter type-id='type-id-175' name='severity' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_dprintf.c' line='67' column='1'/>
      <parameter type-id='type-id-46' name='flags' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_dprintf.c' line='68' column='1'/>
      <return type-id='type-id-177'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_ident.c' comp-dir-path='/home/scythe/mine.zfs/lib/libuutil' language='LANG_C99'>
    <function-decl name='strchr' filepath='/usr/include/string.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-64'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_list.c' comp-dir-path='/home/scythe/mine.zfs/lib/libuutil' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-21' size-in-bits='128' id='type-id-178'>
      <subrange length='2' type-id='type-id-19' id='type-id-22'/>
    </array-type-def>
    <class-decl name='uu_list' size-in-bits='896' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='88' column='1' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ul_next_enc' type-id='type-id-21' visibility='default' filepath='../../include/libuutil_impl.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ul_prev_enc' type-id='type-id-21' visibility='default' filepath='../../include/libuutil_impl.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ul_pool' type-id='type-id-180' visibility='default' filepath='../../include/libuutil_impl.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ul_parent_enc' type-id='type-id-21' visibility='default' filepath='../../include/libuutil_impl.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ul_offset' type-id='type-id-15' visibility='default' filepath='../../include/libuutil_impl.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ul_numnodes' type-id='type-id-15' visibility='default' filepath='../../include/libuutil_impl.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ul_debug' type-id='type-id-39' visibility='default' filepath='../../include/libuutil_impl.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='392'>
        <var-decl name='ul_sorted' type-id='type-id-39' visibility='default' filepath='../../include/libuutil_impl.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='400'>
        <var-decl name='ul_index' type-id='type-id-39' visibility='default' filepath='../../include/libuutil_impl.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ul_null_node' type-id='type-id-181' visibility='default' filepath='../../include/libuutil_impl.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ul_null_walk' type-id='type-id-182' visibility='default' filepath='../../include/libuutil_impl.h' line='101' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='uu_list_pool' size-in-bits='2112' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='108' column='1' id='type-id-183'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ulp_next' type-id='type-id-180' visibility='default' filepath='../../include/libuutil_impl.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ulp_prev' type-id='type-id-180' visibility='default' filepath='../../include/libuutil_impl.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ulp_name' type-id='type-id-136' visibility='default' filepath='../../include/libuutil_impl.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ulp_nodeoffset' type-id='type-id-15' visibility='default' filepath='../../include/libuutil_impl.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ulp_objsize' type-id='type-id-15' visibility='default' filepath='../../include/libuutil_impl.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ulp_cmp' type-id='type-id-152' visibility='default' filepath='../../include/libuutil_impl.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='ulp_debug' type-id='type-id-39' visibility='default' filepath='../../include/libuutil_impl.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='840'>
        <var-decl name='ulp_last_index' type-id='type-id-39' visibility='default' filepath='../../include/libuutil_impl.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ulp_lock' type-id='type-id-141' visibility='default' filepath='../../include/libuutil_impl.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='ulp_null_list' type-id='type-id-184' visibility='default' filepath='../../include/libuutil_impl.h' line='119' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_list_pool_t' type-id='type-id-183' filepath='../../include/libuutil.h' line='188' column='1' id='type-id-185'/>
    <typedef-decl name='uu_list_t' type-id='type-id-179' filepath='../../include/libuutil.h' line='189' column='1' id='type-id-184'/>
    <typedef-decl name='uu_list_node_impl_t' type-id='type-id-186' filepath='../../include/libuutil_impl.h' line='76' column='1' id='type-id-181'/>
    <class-decl name='uu_list_node_impl' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='73' column='1' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uln_next' type-id='type-id-187' visibility='default' filepath='../../include/libuutil_impl.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uln_prev' type-id='type-id-187' visibility='default' filepath='../../include/libuutil_impl.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='uu_list_walk' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='78' column='1' id='type-id-188'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ulw_next' type-id='type-id-189' visibility='default' filepath='../../include/libuutil_impl.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ulw_prev' type-id='type-id-189' visibility='default' filepath='../../include/libuutil_impl.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ulw_list' type-id='type-id-190' visibility='default' filepath='../../include/libuutil_impl.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ulw_dir' type-id='type-id-47' visibility='default' filepath='../../include/libuutil_impl.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='ulw_robust' type-id='type-id-39' visibility='default' filepath='../../include/libuutil_impl.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ulw_next_result' type-id='type-id-191' visibility='default' filepath='../../include/libuutil_impl.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_list_walk_t' type-id='type-id-188' filepath='../../include/libuutil.h' line='195' column='1' id='type-id-182'/>
    <typedef-decl name='uu_list_index_t' type-id='type-id-21' filepath='../../include/libuutil.h' line='197' column='1' id='type-id-192'/>
    <typedef-decl name='uu_list_node_t' type-id='type-id-193' filepath='../../include/libuutil.h' line='193' column='1' id='type-id-194'/>
    <class-decl name='uu_list_node' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/libuutil.h' line='191' column='1' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uln_opaque' type-id='type-id-178' visibility='default' filepath='../../include/libuutil.h' line='192' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-195'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-187'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-191'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-196'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-180'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-190'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-189'/>
    <function-decl name='uu_list_release' mangled-name='uu_list_release' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_release'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_list_lockup' mangled-name='uu_list_lockup' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='699' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_lockup'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_list_prev' mangled-name='uu_list_prev' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='685' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_prev'>
      <parameter type-id='type-id-190' name='lp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='685' column='1'/>
      <parameter type-id='type-id-6' name='elem' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='685' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_next' mangled-name='uu_list_next' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='674' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_next'>
      <parameter type-id='type-id-190' name='lp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='674' column='1'/>
      <parameter type-id='type-id-6' name='elem' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='674' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_last' mangled-name='uu_list_last' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='665' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_last'>
      <parameter type-id='type-id-190' name='lp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='665' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_first' mangled-name='uu_list_first' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='656' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_first'>
      <parameter type-id='type-id-190' name='lp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='656' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_numnodes' mangled-name='uu_list_numnodes' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='650' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_numnodes'>
      <parameter type-id='type-id-190' name='lp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='650' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='uu_list_insert_after' mangled-name='uu_list_insert_after' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='624' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_insert_after'>
      <parameter type-id='type-id-190' name='lp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='624' column='1'/>
      <parameter type-id='type-id-6' name='target' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='624' column='1'/>
      <parameter type-id='type-id-6' name='elem' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='624' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_insert_before' mangled-name='uu_list_insert_before' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_insert_before'>
      <parameter type-id='type-id-190' name='lp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='598' column='1'/>
      <parameter type-id='type-id-6' name='target' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='598' column='1'/>
      <parameter type-id='type-id-6' name='elem' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='598' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_teardown' mangled-name='uu_list_teardown' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='580' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_teardown'>
      <parameter type-id='type-id-190' name='lp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='580' column='1'/>
      <parameter type-id='type-id-172' name='cookie' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='580' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_remove' mangled-name='uu_list_remove' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='540' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_remove'>
      <parameter type-id='type-id-190' name='lp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='540' column='1'/>
      <parameter type-id='type-id-6' name='elem' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='540' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_list_walk' mangled-name='uu_list_walk' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='495' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk'>
      <parameter type-id='type-id-190' name='lp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='495' column='1'/>
      <parameter type-id='type-id-171' name='func' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='495' column='1'/>
      <parameter type-id='type-id-6' name='private' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='495' column='1'/>
      <parameter type-id='type-id-36' name='flags' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='495' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_list_walk_end' mangled-name='uu_list_walk_end' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk_end'>
      <parameter type-id='type-id-189' name='wp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='488' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_list_walk_next' mangled-name='uu_list_walk_next' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk_next'>
      <parameter type-id='type-id-189' name='wp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='476' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_walk_start' mangled-name='uu_list_walk_start' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk_start'>
      <parameter type-id='type-id-190' name='lp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='456' column='1'/>
      <parameter type-id='type-id-36' name='flags' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='456' column='1'/>
      <return type-id='type-id-189'/>
    </function-decl>
    <function-decl name='uu_list_nearest_prev' mangled-name='uu_list_nearest_prev' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='373' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_nearest_prev'>
      <parameter type-id='type-id-190' name='lp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='373' column='1'/>
      <parameter type-id='type-id-192' name='idx' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='373' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_nearest_next' mangled-name='uu_list_nearest_next' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='348' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_nearest_next'>
      <parameter type-id='type-id-190' name='lp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='348' column='1'/>
      <parameter type-id='type-id-192' name='idx' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='348' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_find' mangled-name='uu_list_find' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_find'>
      <parameter type-id='type-id-190' name='lp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='315' column='1'/>
      <parameter type-id='type-id-6' name='elem' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='315' column='1'/>
      <parameter type-id='type-id-6' name='private' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='315' column='1'/>
      <parameter type-id='type-id-195' name='out' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='315' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='uu_list_insert' mangled-name='uu_list_insert' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_insert'>
      <parameter type-id='type-id-190' name='lp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='292' column='1'/>
      <parameter type-id='type-id-6' name='elem' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='292' column='1'/>
      <parameter type-id='type-id-192' name='idx' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='292' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_list_destroy' mangled-name='uu_list_destroy' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_destroy'>
      <parameter type-id='type-id-190' name='lp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='231' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_list_create' mangled-name='uu_list_create' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_create'>
      <parameter type-id='type-id-180' name='pp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='180' column='1'/>
      <parameter type-id='type-id-6' name='parent' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='180' column='1'/>
      <parameter type-id='type-id-36' name='flags' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='180' column='1'/>
      <return type-id='type-id-190'/>
    </function-decl>
    <function-decl name='uu_list_node_fini' mangled-name='uu_list_node_fini' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_node_fini'>
      <parameter type-id='type-id-6' name='base' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='157' column='1'/>
      <parameter type-id='type-id-196' name='np_arg' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='157' column='1'/>
      <parameter type-id='type-id-180' name='pp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='157' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_list_node_init' mangled-name='uu_list_node_init' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_node_init'>
      <parameter type-id='type-id-6' name='base' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='133' column='1'/>
      <parameter type-id='type-id-196' name='np_arg' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='133' column='1'/>
      <parameter type-id='type-id-180' name='pp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='133' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_list_pool_destroy' mangled-name='uu_list_pool_destroy' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_pool_destroy'>
      <parameter type-id='type-id-180' name='pp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='110' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_list_pool_create' mangled-name='uu_list_pool_create' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_pool_create'>
      <parameter type-id='type-id-1' name='name' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='63' column='1'/>
      <parameter type-id='type-id-15' name='objsize' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='63' column='1'/>
      <parameter type-id='type-id-15' name='nodeoffset' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='64' column='1'/>
      <parameter type-id='type-id-152' name='compare_func' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='64' column='1'/>
      <parameter type-id='type-id-36' name='flags' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_list.c' line='64' column='1'/>
      <return type-id='type-id-180'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_misc.c' comp-dir-path='/home/scythe/mine.zfs/lib/libuutil' language='LANG_C99'>
    <typedef-decl name='pthread_t' type-id='type-id-19' filepath='/usr/include/bits/pthreadtypes.h' line='27' column='1' id='type-id-197'/>
    <typedef-decl name='pthread_key_t' type-id='type-id-51' filepath='/usr/include/bits/pthreadtypes.h' line='49' column='1' id='type-id-198'/>
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-199'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-200'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-201'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-202'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-203'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-205'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-207'/>
    <function-decl name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-201'/>
    </function-decl>
    <function-decl name='pthread_atfork' filepath='/usr/include/pthread.h' line='1190' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-205'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pause' filepath='/usr/include/unistd.h' line='478' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='abort' filepath='/usr/include/stdlib.h' line='591' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='pthread_self' filepath='/usr/include/pthread.h' line='253' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-197'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-202'/>
    </function-decl>
    <function-decl name='pthread_getspecific' filepath='/usr/include/pthread.h' line='1164' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-198'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='pthread_setspecific' filepath='/usr/include/pthread.h' line='1167' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-198'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='pthread_key_create' filepath='/usr/include/pthread.h' line='1156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-207'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_dump' mangled-name='uu_dump' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_misc.c' line='260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_dump'>
      <parameter type-id='type-id-75' name='out' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_misc.c' line='260' column='1'/>
      <parameter type-id='type-id-1' name='prefix' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_misc.c' line='260' column='1'/>
      <parameter type-id='type-id-6' name='buf' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_misc.c' line='260' column='1'/>
      <parameter type-id='type-id-15' name='len' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_misc.c' line='260' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='uu_strerror' mangled-name='uu_strerror' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_misc.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strerror'>
      <parameter type-id='type-id-36' name='code' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_misc.c' line='118' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uu_error' mangled-name='uu_error' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_misc.c' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_error'>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-204'>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-206'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_open.c' comp-dir-path='/home/scythe/mine.zfs/lib/libuutil' language='LANG_C99'>
    <typedef-decl name='clockid_t' type-id='type-id-208' filepath='/usr/include/bits/types/clockid_t.h' line='7' column='1' id='type-id-209'/>
    <typedef-decl name='__clockid_t' type-id='type-id-2' filepath='/usr/include/bits/types.h' line='169' column='1' id='type-id-208'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='10' column='1' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-117' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-93' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__time_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-117'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-25' filepath='/usr/include/bits/types.h' line='197' column='1' id='type-id-93'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-210'/>
    <function-decl name='clock_gettime' filepath='/usr/include/time.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-209'/>
      <parameter type-id='type-id-210'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='unlink' filepath='/usr/include/unistd.h' line='838' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uu_open_tmp' mangled-name='uu_open_tmp' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_open.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_open_tmp'>
      <parameter type-id='type-id-1' name='dir' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_open.c' line='41' column='1'/>
      <parameter type-id='type-id-46' name='uflags' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_open.c' line='41' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_pname.c' comp-dir-path='/home/scythe/mine.zfs/lib/libuutil' language='LANG_C99'>
    <var-decl name='uu_exit_ok_value' type-id='type-id-2' mangled-name='uu_exit_ok_value' visibility='default' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_pname.c' line='49' column='1' elf-symbol-id='uu_exit_ok_value'/>
    <var-decl name='uu_exit_fatal_value' type-id='type-id-2' mangled-name='uu_exit_fatal_value' visibility='default' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_pname.c' line='50' column='1' elf-symbol-id='uu_exit_fatal_value'/>
    <var-decl name='uu_exit_usage_value' type-id='type-id-2' mangled-name='uu_exit_usage_value' visibility='default' filepath='/home/scythe/mine.zfs/lib/libuutil/uu_pname.c' line='51' column='1' elf-symbol-id='uu_exit_usage_value'/>
    <function-decl name='getexecname' mangled-name='getexecname' filepath='../../lib/libspl/include/stdlib.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getexecname'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='exit' filepath='/usr/include/stdlib.h' line='617' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='strerror' filepath='/usr/include/string.h' line='403' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='strrchr' filepath='/usr/include/string.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-64'/>
    </function-decl>
